Monash-BoSL/BoSL-IDE-Core/BoSLBoards-1.2.0/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.eeprom=EEPROM
menu.bootloader=Bootloader
menu.serial0buf=Serial Buffer (RX/TX)
menu.twibuf=I2C Buffer (RX/TX)
#menu.serial1buf=Serial1 Buffer (RX/TX)

##############################################################
## BoSL Board 0.5.x w/ ATmega328P @ 3.3V, 8 MHz
bosl0v5.name=BoSL Board 0.5.x
bosl0v5.upload.tool=avrdude
bosl0v5.upload.maximum_data_size=8192
bosl0v5.bootloader.tool=avrdude
bosl0v5.bootloader.unlock_bits=0xff
bosl0v5.bootloader.lock_bits=0xff
bosl0v5.build.core=MCUdude_corefiles
bosl0v5.build.board=AVR_ATmega640
bosl0v5.build.mcu=atmega640
bosl0v5.build.bootloader_led=led+b7
bosl0v5.build.extra_flags={build.clkpr}

# Upload port select
bosl0v5.menu.bootloader.uart0=Yes (UART0)
bosl0v5.menu.bootloader.uart0.upload.maximum_size=65024
bosl0v5.menu.bootloader.uart0.upload.protocol=urclock
bosl0v5.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
bosl0v5.menu.bootloader.uart0.build.export_merged_output=true
bosl0v5.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

bosl0v5.menu.bootloader.uart1=Yes (UART1)
bosl0v5.menu.bootloader.uart1.upload.maximum_size=65024
bosl0v5.menu.bootloader.uart1.upload.protocol=urclock
bosl0v5.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
bosl0v5.menu.bootloader.uart1.build.export_merged_output=true
bosl0v5.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

bosl0v5.menu.bootloader.uart2=Yes (UART2)
bosl0v5.menu.bootloader.uart2.upload.maximum_size=65024
bosl0v5.menu.bootloader.uart2.upload.protocol=urclock
bosl0v5.menu.bootloader.uart2.upload.uartpins=uart2_rxh0_txh1
bosl0v5.menu.bootloader.uart2.build.export_merged_output=true
bosl0v5.menu.bootloader.uart2.bootloader.file=urboot/{build.mcu}/watchdog_1_s/{build.oscillator}/{build.clock_speed}/{upload.speed}/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

bosl0v5.menu.bootloader.uart3=Yes (UART3)
bosl0v5.menu.bootloader.uart3.upload.maximum_size=65024
bosl0v5.menu.bootloader.uart3.upload.protocol=urclock
bosl0v5.menu.bootloader.uart3.upload.uartpins=uart3_rxj0_txj1
bosl0v5.menu.bootloader.uart3.build.export_merged_output=true
bosl0v5.menu.bootloader.uart3.bootloader.file=urboot/{build.mcu}/watchdog_1_s/{build.oscillator}/{build.clock_speed}/{upload.speed}/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

bosl0v5.menu.bootloader.no_bootloader=No bootloader
bosl0v5.menu.bootloader.no_bootloader.upload.maximum_size=65536
bosl0v5.menu.bootloader.no_bootloader.build.export_merged_output=false
bosl0v5.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
bosl0v5.menu.eeprom.keep=EEPROM retained
bosl0v5.menu.eeprom.keep.bootloader.high_fuses=0xd7
bosl0v5.menu.eeprom.erase=EEPROM not retained
bosl0v5.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Pinouts
bosl0v5.menu.pinout.mega_pinout=Arduino MEGA pinout
bosl0v5.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
bosl0v5.menu.pinout.avr_pinout=AVR pinout
bosl0v5.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
bosl0v5.menu.BOD.2v7=BOD 2.7V
bosl0v5.menu.BOD.2v7.bootloader.extended_fuses=0xfd
bosl0v5.menu.BOD.4v3=BOD 4.3V
bosl0v5.menu.BOD.4v3.bootloader.extended_fuses=0xfc
bosl0v5.menu.BOD.1v8=BOD 1.8V
bosl0v5.menu.BOD.1v8.bootloader.extended_fuses=0xfe
bosl0v5.menu.BOD.disabled=BOD disabled
bosl0v5.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
bosl0v5.menu.LTO.Os_flto=LTO enabled
bosl0v5.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
bosl0v5.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
bosl0v5.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
bosl0v5.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

bosl0v5.menu.LTO.Os=LTO disabled
bosl0v5.menu.LTO.Os.compiler.c.extra_flags=
bosl0v5.menu.LTO.Os.compiler.c.elf.extra_flags=
bosl0v5.menu.LTO.Os.compiler.cpp.extra_flags=
bosl0v5.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
bosl0v5.menu.clock.16MHz_external=External 16 MHz
bosl0v5.menu.clock.16MHz_external.upload.speed=115200
bosl0v5.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.16MHz_external.build.clkpr=
bosl0v5.menu.clock.16MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.16MHz_external.build.clock_speed=16000000_hz
bosl0v5.menu.clock.16MHz_external.build.f_cpu=16000000L

bosl0v5.menu.clock.20MHz_external=External 20 MHz
bosl0v5.menu.clock.20MHz_external.upload.speed=115200
bosl0v5.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.20MHz_external.build.clkpr=
bosl0v5.menu.clock.20MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.20MHz_external.build.clock_speed=20000000_hz
bosl0v5.menu.clock.20MHz_external.build.f_cpu=20000000L

bosl0v5.menu.clock.18_432MHz_external=External 18.4320 MHz
bosl0v5.menu.clock.18_432MHz_external.upload.speed=115200
bosl0v5.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.18_432MHz_external.build.clkpr=
bosl0v5.menu.clock.18_432MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.18_432MHz_external.build.clock_speed=18432000_hz
bosl0v5.menu.clock.18_432MHz_external.build.f_cpu=18432000L

bosl0v5.menu.clock.14_7456MHz_external=External 14.7456 MHz
bosl0v5.menu.clock.14_7456MHz_external.upload.speed=115200
bosl0v5.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.14_7456MHz_external.build.clkpr=
bosl0v5.menu.clock.14_7456MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.14_7456MHz_external.build.clock_speed=14745600_hz
bosl0v5.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

bosl0v5.menu.clock.12MHz_external=External 12 MHz
bosl0v5.menu.clock.12MHz_external.upload.speed=57600
bosl0v5.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.12MHz_external.build.clkpr=
bosl0v5.menu.clock.12MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.12MHz_external.build.clock_speed=12000000_hz
bosl0v5.menu.clock.12MHz_external.build.f_cpu=12000000L

