Monash-BoSL/BoSL-IDE-Core/BoSLBoards-1.2.0/boards.txt
bosl0v5.menu.clock.11_0592MHz_external=External 11.0592 MHz
bosl0v5.menu.clock.11_0592MHz_external.upload.speed=115200
bosl0v5.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.11_0592MHz_external.build.clkpr=
bosl0v5.menu.clock.11_0592MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.11_0592MHz_external.build.clock_speed=11059200_hz
bosl0v5.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

bosl0v5.menu.clock.8MHz_external=External 8 MHz
bosl0v5.menu.clock.8MHz_external.upload.speed=57600
bosl0v5.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.8MHz_external.build.clkpr=
bosl0v5.menu.clock.8MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.8MHz_external.build.clock_speed=8000000L_hz
bosl0v5.menu.clock.8MHz_external.build.f_cpu=8000000L

bosl0v5.menu.clock.7_3728MHz_external=External 7.3728 MHz
bosl0v5.menu.clock.7_3728MHz_external.upload.speed=115200
bosl0v5.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.7_3728MHz_external.build.clkpr=
bosl0v5.menu.clock.7_3728MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.7_3728MHz_external.build.clock_speed=7372800_hz
bosl0v5.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

bosl0v5.menu.clock.6MHz_external=External 6 MHz
bosl0v5.menu.clock.6MHz_external.upload.speed=57600
bosl0v5.menu.clock.6MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.6MHz_external.build.clkpr=
bosl0v5.menu.clock.6MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.6MHz_external.build.clock_speed=6000000_hz
bosl0v5.menu.clock.6MHz_external.build.f_cpu=6000000L

bosl0v5.menu.clock.4MHz_external=External 4 MHz
bosl0v5.menu.clock.4MHz_external.upload.speed=9600
bosl0v5.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.4MHz_external.build.clkpr=
bosl0v5.menu.clock.4MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.4MHz_external.build.clock_speed=4000000_hz
bosl0v5.menu.clock.4MHz_external.build.f_cpu=4000000L

bosl0v5.menu.clock.3_6864MHz_external=External 3.6864 MHz
bosl0v5.menu.clock.3_6864MHz_external.upload.speed=115200
bosl0v5.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.3_6864MHz_external.build.clkpr=
bosl0v5.menu.clock.3_6864MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.3_6864MHz_external.build.clock_speed=3686400_hz
bosl0v5.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

bosl0v5.menu.clock.2MHz_external=External 2 MHz
bosl0v5.menu.clock.2MHz_external.upload.speed=9600
bosl0v5.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.2MHz_external.build.clkpr=
bosl0v5.menu.clock.2MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.2MHz_external.build.clock_speed=2000000_hz
bosl0v5.menu.clock.2MHz_external.build.f_cpu=2000000L

bosl0v5.menu.clock.1_8432MHz_external=External 1.8432 MHz
bosl0v5.menu.clock.1_8432MHz_external.upload.speed=115200
bosl0v5.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.1_8432MHz_external.build.clkpr=
bosl0v5.menu.clock.1_8432MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.1_8432MHz_external.build.clock_speed=1843200_hz
bosl0v5.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

bosl0v5.menu.clock.1MHz_external=External 1 MHz
bosl0v5.menu.clock.1MHz_external.upload.speed=9600
bosl0v5.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
bosl0v5.menu.clock.1MHz_external.build.clkpr=
bosl0v5.menu.clock.1MHz_external.build.oscillator=external_oscillator
bosl0v5.menu.clock.1MHz_external.build.clock_speed=1000000_hz
bosl0v5.menu.clock.1MHz_external.build.f_cpu=1000000L

bosl0v5.menu.clock.8MHz_internal=Internal 8 MHz
bosl0v5.menu.clock.8MHz_internal.upload.speed=38400
bosl0v5.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
bosl0v5.menu.clock.8MHz_internal.build.clkpr=
bosl0v5.menu.clock.8MHz_internal.build.oscillator=internal_oscillator
bosl0v5.menu.clock.8MHz_internal.build.clock_speed=8000000_hz
bosl0v5.menu.clock.8MHz_internal.build.f_cpu=8000000L

bosl0v5.menu.clock.4MHz_internal=Internal 4 MHz
bosl0v5.menu.clock.4MHz_internal.upload.speed=9600
bosl0v5.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
bosl0v5.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
bosl0v5.menu.clock.4MHz_internal.build.oscillator=internal_oscillator
bosl0v5.menu.clock.4MHz_internal.build.clock_speed=8000000_hz
bosl0v5.menu.clock.4MHz_internal.build.f_cpu=4000000L

bosl0v5.menu.clock.2MHz_internal=Internal 2 MHz
bosl0v5.menu.clock.2MHz_internal.upload.speed=9600
bosl0v5.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
bosl0v5.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
bosl0v5.menu.clock.2MHz_internal.build.oscillator=internal_oscillator
bosl0v5.menu.clock.2MHz_internal.build.clock_speed=8000000_hz
bosl0v5.menu.clock.2MHz_internal.build.f_cpu=2000000L

bosl0v5.menu.clock.1MHz_internal=Internal 1 MHz
bosl0v5.menu.clock.1MHz_internal.upload.speed=9600
bosl0v5.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
bosl0v5.menu.clock.1MHz_internal.build.clkpr=
bosl0v5.menu.clock.1MHz_internal.build.oscillator=internal_oscillator
bosl0v5.menu.clock.1MHz_internal.build.clock_speed=1000000_hz
bosl0v5.menu.clock.1MHz_internal.build.f_cpu=1000000L

##############################################################
## BoSL Board 0.4.x w/ ATmega328P @ 3.3V, 8 MHz
bosl0v4.name=BoSL Board 0.4.x
bosl0v4.upload.tool=avrdude
bosl0v4.upload.maximum_data_size=2048
bosl0v4.bootloader.tool=avrdude
bosl0v4.bootloader.unlock_bits=0x3f
bosl0v4.bootloader.lock_bits=0x0f
bosl0v4.build.core=MCUdude_corefiles
bosl0v4.build.board=BOSL0V4_BOARD
bosl0v4.build.bootloader_led=B5
bosl0v4.build.extra_flags={build.clkpr}

# Upload port select
bosl0v4.menu.bootloader.uart0=Yes (UART0)
bosl0v4.menu.bootloader.uart0.upload.maximum_size=32256
bosl0v4.menu.bootloader.uart0.upload.protocol=arduino
bosl0v4.menu.bootloader.uart0.upload.port=UART0
bosl0v4.menu.bootloader.uart0.build.export_merged_output=true
bosl0v4.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
bosl0v4.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}.hex

bosl0v4.menu.bootloader.no_bootloader=No bootloader
bosl0v4.menu.bootloader.no_bootloader.upload.maximum_size=32768
bosl0v4.menu.bootloader.no_bootloader.build.export_merged_output=false
bosl0v4.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
bosl0v4.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
bosl0v4.menu.eeprom.keep=EEPROM retained
bosl0v4.menu.eeprom.keep.bootloader.eesave_bit=0
bosl0v4.menu.eeprom.erase=EEPROM not retained
bosl0v4.menu.eeprom.erase.bootloader.eesave_bit=1

