Monash-BoSL/BoSL-IDE-Core/BoSLBoards-1.2.0/boards.txt
#328PB.menu.serial1buf.sb6416=64/16
#328PB.menu.serial1buf.sb6416.compilerSB1.c.extra_flags=-DSERIAL_RX_BUFFER_SIZE=64 -DSERIAL_TX_BUFFER_SIZE=16
#328PB.menu.serial1buf.sb6416.compilerSB1.cpp.extra_flags=-DSERIAL_RX_BUFFER_SIZE=64 -DSERIAL_TX_BUFFER_SIZE=16

#328PB.menu.serial1buf.sb3216=32/16
#328PB.menu.serial1buf.sb3216.compilerSB1.c.extra_flags=-DSERIAL_RX_BUFFER_SIZE=32 -DSERIAL_TX_BUFFER_SIZE=16
#328PB.menu.serial1buf.sb3216.compilerSB1.cpp.extra_flags=-DSERIAL_RX_BUFFER_SIZE=32 -DSERIAL_TX_BUFFER_SIZE=16

#328PB.menu.serial1buf.sb1616=16/16
#328PB.menu.serial1buf.sb1616.compilerSB1.c.extra_flags=-DSERIAL_RX_BUFFER_SIZE=16 -DSERIAL_TX_BUFFER_SIZE=16
#328PB.menu.serial1buf.sb1616.compilerSB1.cpp.extra_flags=-DSERIAL_RX_BUFFER_SIZE=16 -DSERIAL_TX_BUFFER_SIZE=16

#I2C buffer
328PB.menu.twibuf.disabled=Default
328PB.menu.twibuf.disabled.compilerTWI.c.extra_flags=
328PB.menu.twibuf.disabled.compilerTWI.cpp.extra_flags=

328PB.menu.twibuf.twb3232=32/32
328PB.menu.twibuf.twb3232.compilerTWI.c.extra_flags=-DTWI_BUFFER_SIZE=32 
328PB.menu.twibuf.twb3232.compilerTWI.cpp.extra_flags=-DTWI_BUFFER_SIZE=32 

328PB.menu.twibuf.twb1616=16/16
328PB.menu.twibuf.twb1616.compilerTWI.c.extra_flags=-DTWI_BUFFER_SIZE=16 
328PB.menu.twibuf.twb1616.compilerTWI.cpp.extra_flags=-DTWI_BUFFER_SIZE=16

328PB.menu.twibuf.twb88=8/8
328PB.menu.twibuf.twb88.compilerTWI.c.extra_flags=-DTWI_BUFFER_SIZE=8 
328PB.menu.twibuf.twb88.compilerTWI.cpp.extra_flags=-DTWI_BUFFER_SIZE=8 

#LTO
328PB.compiler.c.extra_flags=-Wextra -flto -g {compilerSB0.c.extra_flags} {compilerTWI.c.extra_flags}
328PB.compiler.c.elf.extra_flags=-w -flto -g 
328PB.compiler.cpp.extra_flags=-Wextra -flto -g {compilerSB0.cpp.extra_flags} {compilerTWI.cpp.extra_flags}
328PB.ltoarcmd=avr-gcc-ar

# Clock frequencies
328PB.upload.speed=57600
328PB.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
328PB.build.clkpr=
328PB.build.clock_speed={build.f_cpu}
328PB.build.f_cpu=8000000L